LiteOS/LiteOS/platform/NRF52840-PDK/config/sdk_config.h
/**
 * Copyright (c) 2017 - 2017, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */

#ifndef SDK_CONFIG_H
#define SDK_CONFIG_H
// <<< Use Configuration Wizard in Context Menu >>>\n
#ifdef USE_APP_CONFIG
#include "app_config.h"
#endif
// <h> nRF_ANT 

//==========================================================
// <e> ANTFS_ENABLED - ant_fs - ANT File Share module.
//==========================================================
#ifndef ANTFS_ENABLED
#define ANTFS_ENABLED 0
#endif
#if  ANTFS_ENABLED
// <o> ANTFS_CONFIG_NETWORK_NUMBER - ANT-FS network number. 
#ifndef ANTFS_CONFIG_NETWORK_NUMBER
#define ANTFS_CONFIG_NETWORK_NUMBER 0
#endif

// <o> ANTFS_CONFIG_CHANNEL_NUMBER - ANT-FS channel number. 
#ifndef ANTFS_CONFIG_CHANNEL_NUMBER
#define ANTFS_CONFIG_CHANNEL_NUMBER 0
#endif

// <o> ANTFS_CONFIG_PAIRING_TIMEOUT - Pairing timeout - how long the UI will wait for a response to a pairing request before switching to the link layer, in seconds. 
#ifndef ANTFS_CONFIG_PAIRING_TIMEOUT
#define ANTFS_CONFIG_PAIRING_TIMEOUT 120
#endif

// <o> ANTFS_CONFIG_LINK_COMMAND_TIMEOUT - Command timeout - how long the client will wait without receiving any commands before switching to the link layer, in seconds. 
#ifndef ANTFS_CONFIG_LINK_COMMAND_TIMEOUT
#define ANTFS_CONFIG_LINK_COMMAND_TIMEOUT 10
#endif

// <o> ANTFS_CONFIG_TRANS_TYPE - ANT-FS Transmission Type. 
#ifndef ANTFS_CONFIG_TRANS_TYPE
#define ANTFS_CONFIG_TRANS_TYPE 10
#endif

// <o> ANTFS_CONFIG_DEVICE_TYPE - ANT device type for channel configuration. 
#ifndef ANTFS_CONFIG_DEVICE_TYPE
#define ANTFS_CONFIG_DEVICE_TYPE 1
#endif

// <o> ANTFS_CONFIG_BEACON_STATUS_PERIOD  - ANT-FS Beacon Message Period.
 
// <0=> 0.5 Hz 
// <1=> 1 Hz 
// <2=> 2 Hz 
// <3=> 4 Hz 
// <4=> 8 Hz 

#ifndef ANTFS_CONFIG_BEACON_STATUS_PERIOD
#define ANTFS_CONFIG_BEACON_STATUS_PERIOD 3
#endif

// <o> ANTFS_CONFIG_TRANSMIT_POWER  - ANT Transmit Power.
 
// <0=> Lowest ANT Tx power level setting. (-20dBm) 
// <1=> ANT Tx power > Lvl 0. (-12dBm) 
// <2=> ANT Tx power > Lvl 1. (-4dBm) 
// <3=> ANT Tx power > Lvl 2. Default tx power level. (0dBm) 
// <4=> ANT Tx power > Lvl 3. (+4dBm) 
// <128=> Custom tx power selection 

#ifndef ANTFS_CONFIG_TRANSMIT_POWER
#define ANTFS_CONFIG_TRANSMIT_POWER 3
#endif

// <o> ANTFS_CONFIG_CUSTOM_TRANSMIT_POWER - ANT Custom Transmit Power. 
#ifndef ANTFS_CONFIG_CUSTOM_TRANSMIT_POWER
#define ANTFS_CONFIG_CUSTOM_TRANSMIT_POWER 0
#endif

// <q> ANTFS_CONFIG_AUTH_TYPE_PAIRING_ENABLED  - Use pairing and key exchange authentication.
 

#ifndef ANTFS_CONFIG_AUTH_TYPE_PAIRING_ENABLED
#define ANTFS_CONFIG_AUTH_TYPE_PAIRING_ENABLED 0
#endif

// <q> ANTFS_CONFIG_AUTH_TYPE_PASSKEY_ENABLED  - Use passkey authentication.
 

#ifndef ANTFS_CONFIG_AUTH_TYPE_PASSKEY_ENABLED
#define ANTFS_CONFIG_AUTH_TYPE_PASSKEY_ENABLED 0
#endif

// <q> ANTFS_CONFIG_AUTH_TYPE_PASSTHROUGH_ENABLED  - Allow host to bypass authentication.
 

#ifndef ANTFS_CONFIG_AUTH_TYPE_PASSTHROUGH_ENABLED
#define ANTFS_CONFIG_AUTH_TYPE_PASSTHROUGH_ENABLED 0
#endif

// <q> ANTFS_CONFIG_UPLOAD_ENABLED  - Support upload operation.
 

#ifndef ANTFS_CONFIG_UPLOAD_ENABLED
#define ANTFS_CONFIG_UPLOAD_ENABLED 0
#endif

// <q> ANTFS_CONFIG_DEBUG_LED_ENABLED  - Enables LED debug in the module.
 

#ifndef ANTFS_CONFIG_DEBUG_LED_ENABLED
#define ANTFS_CONFIG_DEBUG_LED_ENABLED 0
#endif

#endif //ANTFS_ENABLED
// </e>

// <e> ANT_BPWR_ENABLED - ant_bpwr - Bicycle Power Profile
//==========================================================
#ifndef ANT_BPWR_ENABLED
#define ANT_BPWR_ENABLED 0
#endif
#if  ANT_BPWR_ENABLED
// <e> ANT_BPWR_LOG_ENABLED - Enables general logging in the module.
//==========================================================
#ifndef ANT_BPWR_LOG_ENABLED
#define ANT_BPWR_LOG_ENABLED 0
#endif
#if  ANT_BPWR_LOG_ENABLED
// <o> ANT_BPWR_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BPWR_LOG_LEVEL
#define ANT_BPWR_LOG_LEVEL 3
#endif

// <o> ANT_BPWR_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BPWR_INFO_COLOR
#define ANT_BPWR_INFO_COLOR 0
#endif

