LiteOS/LiteOS/platform/NRF52840-PDK/config/sdk_config.h
#endif //ANT_BPWR_LOG_ENABLED
// </e>

// <e> ANT_BPWR_COMMON_LOG_ENABLED - Enables logging of BPWR tracing common data.
//==========================================================
#ifndef ANT_BPWR_COMMON_LOG_ENABLED
#define ANT_BPWR_COMMON_LOG_ENABLED 0
#endif
#if  ANT_BPWR_COMMON_LOG_ENABLED
// <o> ANT_BPWR_COMMON_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BPWR_COMMON_LOG_LEVEL
#define ANT_BPWR_COMMON_LOG_LEVEL 3
#endif

// <o> ANT_BPWR_COMMON_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BPWR_COMMON_INFO_COLOR
#define ANT_BPWR_COMMON_INFO_COLOR 0
#endif

#endif //ANT_BPWR_COMMON_LOG_ENABLED
// </e>

// <e> ANT_BPWR_PAGE_TORQUE_LOG_ENABLED - Enables logging of BPWR torque page in the module.
//==========================================================
#ifndef ANT_BPWR_PAGE_TORQUE_LOG_ENABLED
#define ANT_BPWR_PAGE_TORQUE_LOG_ENABLED 0
#endif
#if  ANT_BPWR_PAGE_TORQUE_LOG_ENABLED
// <o> ANT_BPWR_PAGE_TORQUE_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BPWR_PAGE_TORQUE_LOG_LEVEL
#define ANT_BPWR_PAGE_TORQUE_LOG_LEVEL 3
#endif

// <o> ANT_BPWR_PAGE_TORQUE_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BPWR_PAGE_TORQUE_INFO_COLOR
#define ANT_BPWR_PAGE_TORQUE_INFO_COLOR 0
#endif

#endif //ANT_BPWR_PAGE_TORQUE_LOG_ENABLED
// </e>

// <e> ANT_BPWR_PAGE_1_LOG_ENABLED - Enables logging of BPWR page 1 in the module.
//==========================================================
#ifndef ANT_BPWR_PAGE_1_LOG_ENABLED
#define ANT_BPWR_PAGE_1_LOG_ENABLED 0
#endif
#if  ANT_BPWR_PAGE_1_LOG_ENABLED
// <o> ANT_BPWR_PAGE_1_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BPWR_PAGE_1_LOG_LEVEL
#define ANT_BPWR_PAGE_1_LOG_LEVEL 3
#endif

// <o> ANT_BPWR_PAGE_1_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BPWR_PAGE_1_INFO_COLOR
#define ANT_BPWR_PAGE_1_INFO_COLOR 0
#endif

#endif //ANT_BPWR_PAGE_1_LOG_ENABLED
// </e>

// <e> ANT_BPWR_PAGE_16_LOG_ENABLED - Enables logging of BPWR page 16 in the module.
//==========================================================
#ifndef ANT_BPWR_PAGE_16_LOG_ENABLED
#define ANT_BPWR_PAGE_16_LOG_ENABLED 0
#endif
#if  ANT_BPWR_PAGE_16_LOG_ENABLED
// <o> ANT_BPWR_PAGE_16_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BPWR_PAGE_16_LOG_LEVEL
#define ANT_BPWR_PAGE_16_LOG_LEVEL 3
#endif

// <o> ANT_BPWR_PAGE_16_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BPWR_PAGE_16_INFO_COLOR
#define ANT_BPWR_PAGE_16_INFO_COLOR 0
#endif

#endif //ANT_BPWR_PAGE_16_LOG_ENABLED
// </e>

// <e> ANT_BPWR_PAGE_17_LOG_ENABLED - Enables logging of BPWR page 17 in the module.
//==========================================================
#ifndef ANT_BPWR_PAGE_17_LOG_ENABLED
#define ANT_BPWR_PAGE_17_LOG_ENABLED 0
#endif
#if  ANT_BPWR_PAGE_17_LOG_ENABLED
// <o> ANT_BPWR_PAGE_17_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BPWR_PAGE_17_LOG_LEVEL
#define ANT_BPWR_PAGE_17_LOG_LEVEL 3
#endif

// <o> ANT_BPWR_PAGE_17_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BPWR_PAGE_17_INFO_COLOR
#define ANT_BPWR_PAGE_17_INFO_COLOR 0
#endif

#endif //ANT_BPWR_PAGE_17_LOG_ENABLED
// </e>

// <e> ANT_BPWR_PAGE_18_LOG_ENABLED - Enables logging of BPWR page 18 in the module.
//==========================================================
#ifndef ANT_BPWR_PAGE_18_LOG_ENABLED
#define ANT_BPWR_PAGE_18_LOG_ENABLED 0
#endif
#if  ANT_BPWR_PAGE_18_LOG_ENABLED
// <o> ANT_BPWR_PAGE_18_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BPWR_PAGE_18_LOG_LEVEL
#define ANT_BPWR_PAGE_18_LOG_LEVEL 3
#endif

// <o> ANT_BPWR_PAGE_18_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BPWR_PAGE_18_INFO_COLOR
#define ANT_BPWR_PAGE_18_INFO_COLOR 0
#endif

#endif //ANT_BPWR_PAGE_18_LOG_ENABLED
// </e>

#endif //ANT_BPWR_ENABLED
// </e>

// <e> ANT_BSC_ENABLED - ant_bsc - Bicycle Speed and Cadence Profile
//==========================================================
#ifndef ANT_BSC_ENABLED
#define ANT_BSC_ENABLED 0
#endif
#if  ANT_BSC_ENABLED
// <e> ANT_BSC_LOG_ENABLED - Enables general logging in the module.
//==========================================================
#ifndef ANT_BSC_LOG_ENABLED
#define ANT_BSC_LOG_ENABLED 0
#endif
#if  ANT_BSC_LOG_ENABLED
// <o> ANT_BSC_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BSC_LOG_LEVEL
#define ANT_BSC_LOG_LEVEL 3
#endif

// <o> ANT_BSC_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BSC_INFO_COLOR
#define ANT_BSC_INFO_COLOR 0
#endif

#endif //ANT_BSC_LOG_ENABLED
// </e>

// <e> ANT_BSC_COMBINED_PAGE_0_LOG_ENABLED - Enables logging of BSC Combined page 0 in the module.
//==========================================================
#ifndef ANT_BSC_COMBINED_PAGE_0_LOG_ENABLED
#define ANT_BSC_COMBINED_PAGE_0_LOG_ENABLED 0
#endif
#if  ANT_BSC_COMBINED_PAGE_0_LOG_ENABLED
// <o> ANT_BSC_COMBINED_PAGE_0_LOG_LEVEL  - Default Severity level
 
