LiteOS/LiteOS/platform/NRF52840-PDK/config/sdk_config.h
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BSC_COMBINED_PAGE_0_LOG_LEVEL
#define ANT_BSC_COMBINED_PAGE_0_LOG_LEVEL 3
#endif

// <o> ANT_BSC_COMBINED_PAGE_0_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BSC_COMBINED_PAGE_0_INFO_COLOR
#define ANT_BSC_COMBINED_PAGE_0_INFO_COLOR 0
#endif

#endif //ANT_BSC_COMBINED_PAGE_0_LOG_ENABLED
// </e>

// <e> ANT_BSC_PAGE_0_LOG_ENABLED - Enables logging of BSC page 0 in the module.
//==========================================================
#ifndef ANT_BSC_PAGE_0_LOG_ENABLED
#define ANT_BSC_PAGE_0_LOG_ENABLED 0
#endif
#if  ANT_BSC_PAGE_0_LOG_ENABLED
// <o> ANT_BSC_PAGE_0_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BSC_PAGE_0_LOG_LEVEL
#define ANT_BSC_PAGE_0_LOG_LEVEL 3
#endif

// <o> ANT_BSC_PAGE_0_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BSC_PAGE_0_INFO_COLOR
#define ANT_BSC_PAGE_0_INFO_COLOR 0
#endif

#endif //ANT_BSC_PAGE_0_LOG_ENABLED
// </e>

// <e> ANT_BSC_PAGE_1_LOG_ENABLED - Enables logging of BSC page 1 in the module.
//==========================================================
#ifndef ANT_BSC_PAGE_1_LOG_ENABLED
#define ANT_BSC_PAGE_1_LOG_ENABLED 0
#endif
#if  ANT_BSC_PAGE_1_LOG_ENABLED
// <o> ANT_BSC_PAGE_1_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BSC_PAGE_1_LOG_LEVEL
#define ANT_BSC_PAGE_1_LOG_LEVEL 3
#endif

// <o> ANT_BSC_PAGE_1_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BSC_PAGE_1_INFO_COLOR
#define ANT_BSC_PAGE_1_INFO_COLOR 0
#endif

#endif //ANT_BSC_PAGE_1_LOG_ENABLED
// </e>

// <e> ANT_BSC_PAGE_2_LOG_ENABLED - Enables logging of BSC page 2 in the module.
//==========================================================
#ifndef ANT_BSC_PAGE_2_LOG_ENABLED
#define ANT_BSC_PAGE_2_LOG_ENABLED 0
#endif
#if  ANT_BSC_PAGE_2_LOG_ENABLED
// <o> ANT_BSC_PAGE_2_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BSC_PAGE_2_LOG_LEVEL
#define ANT_BSC_PAGE_2_LOG_LEVEL 3
#endif

// <o> ANT_BSC_PAGE_2_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BSC_PAGE_2_INFO_COLOR
#define ANT_BSC_PAGE_2_INFO_COLOR 0
#endif

#endif //ANT_BSC_PAGE_2_LOG_ENABLED
// </e>

// <e> ANT_BSC_PAGE_3_LOG_ENABLED - Enables logging of BSC page 3 in the module.
//==========================================================
#ifndef ANT_BSC_PAGE_3_LOG_ENABLED
#define ANT_BSC_PAGE_3_LOG_ENABLED 0
#endif
#if  ANT_BSC_PAGE_3_LOG_ENABLED
// <o> ANT_BSC_PAGE_3_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BSC_PAGE_3_LOG_LEVEL
#define ANT_BSC_PAGE_3_LOG_LEVEL 3
#endif

// <o> ANT_BSC_PAGE_3_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BSC_PAGE_3_INFO_COLOR
#define ANT_BSC_PAGE_3_INFO_COLOR 0
#endif

#endif //ANT_BSC_PAGE_3_LOG_ENABLED
// </e>

// <e> ANT_BSC_PAGE_4_LOG_ENABLED - Enables logging of BSC page 4 in the module.
//==========================================================
#ifndef ANT_BSC_PAGE_4_LOG_ENABLED
#define ANT_BSC_PAGE_4_LOG_ENABLED 0
#endif
#if  ANT_BSC_PAGE_4_LOG_ENABLED
// <o> ANT_BSC_PAGE_4_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BSC_PAGE_4_LOG_LEVEL
#define ANT_BSC_PAGE_4_LOG_LEVEL 3
#endif

// <o> ANT_BSC_PAGE_4_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BSC_PAGE_4_INFO_COLOR
#define ANT_BSC_PAGE_4_INFO_COLOR 0
#endif

#endif //ANT_BSC_PAGE_4_LOG_ENABLED
// </e>

// <e> ANT_BSC_PAGE_5_LOG_ENABLED - Enables logging of BSC page 5 in the module.
//==========================================================
#ifndef ANT_BSC_PAGE_5_LOG_ENABLED
#define ANT_BSC_PAGE_5_LOG_ENABLED 0
#endif
#if  ANT_BSC_PAGE_5_LOG_ENABLED
// <o> ANT_BSC_PAGE_5_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_BSC_PAGE_5_LOG_LEVEL
#define ANT_BSC_PAGE_5_LOG_LEVEL 3
#endif

// <o> ANT_BSC_PAGE_5_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_BSC_PAGE_5_INFO_COLOR
#define ANT_BSC_PAGE_5_INFO_COLOR 0
#endif

#endif //ANT_BSC_PAGE_5_LOG_ENABLED
// </e>

#endif //ANT_BSC_ENABLED
// </e>

// <q> ANT_CHANNEL_CONFIG_ENABLED  - ant_channel_config - ANT common channel configuration
 

#ifndef ANT_CHANNEL_CONFIG_ENABLED
#define ANT_CHANNEL_CONFIG_ENABLED 0
#endif

// <e> ANT_COMMON_PAGE_70_ENABLED - ant_common_page_70 - ANT+ common page 70
//==========================================================
#ifndef ANT_COMMON_PAGE_70_ENABLED
#define ANT_COMMON_PAGE_70_ENABLED 0
#endif
#if  ANT_COMMON_PAGE_70_ENABLED
// <e> ANT_COMMON_PAGE_70_LOG_ENABLED - Enables logging of common page 70 in the module.
//==========================================================
#ifndef ANT_COMMON_PAGE_70_LOG_ENABLED
#define ANT_COMMON_PAGE_70_LOG_ENABLED 0
#endif
#if  ANT_COMMON_PAGE_70_LOG_ENABLED
// <o> ANT_COMMON_PAGE_70_LOG_LEVEL  - Default Severity level
 
