LiteOS/LiteOS/platform/NRF52840-PDK/config/sdk_config.h
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_COMMON_PAGE_70_LOG_LEVEL
#define ANT_COMMON_PAGE_70_LOG_LEVEL 3
#endif

// <o> ANT_COMMON_PAGE_70_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_COMMON_PAGE_70_INFO_COLOR
#define ANT_COMMON_PAGE_70_INFO_COLOR 0
#endif

#endif //ANT_COMMON_PAGE_70_LOG_ENABLED
// </e>

#endif //ANT_COMMON_PAGE_70_ENABLED
// </e>

// <e> ANT_COMMON_PAGE_80_ENABLED - ant_common_page_80 - ANT+ common page 80
//==========================================================
#ifndef ANT_COMMON_PAGE_80_ENABLED
#define ANT_COMMON_PAGE_80_ENABLED 0
#endif
#if  ANT_COMMON_PAGE_80_ENABLED
// <e> ANT_COMMON_PAGE_80_LOG_ENABLED - Enables logging of common page 80 in the module.
//==========================================================
#ifndef ANT_COMMON_PAGE_80_LOG_ENABLED
#define ANT_COMMON_PAGE_80_LOG_ENABLED 0
#endif
#if  ANT_COMMON_PAGE_80_LOG_ENABLED
// <o> ANT_COMMON_PAGE_80_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_COMMON_PAGE_80_LOG_LEVEL
#define ANT_COMMON_PAGE_80_LOG_LEVEL 3
#endif

// <o> ANT_COMMON_PAGE_80_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_COMMON_PAGE_80_INFO_COLOR
#define ANT_COMMON_PAGE_80_INFO_COLOR 0
#endif

#endif //ANT_COMMON_PAGE_80_LOG_ENABLED
// </e>

#endif //ANT_COMMON_PAGE_80_ENABLED
// </e>

// <e> ANT_COMMON_PAGE_81_ENABLED - ant_common_page_81 - ANT+ common page 81
//==========================================================
#ifndef ANT_COMMON_PAGE_81_ENABLED
#define ANT_COMMON_PAGE_81_ENABLED 0
#endif
#if  ANT_COMMON_PAGE_81_ENABLED
// <e> ANT_COMMON_PAGE_81_LOG_ENABLED - Enables logging of common page 81 in the module.
//==========================================================
#ifndef ANT_COMMON_PAGE_81_LOG_ENABLED
#define ANT_COMMON_PAGE_81_LOG_ENABLED 0
#endif
#if  ANT_COMMON_PAGE_81_LOG_ENABLED
// <o> ANT_COMMON_PAGE_81_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_COMMON_PAGE_81_LOG_LEVEL
#define ANT_COMMON_PAGE_81_LOG_LEVEL 3
#endif

// <o> ANT_COMMON_PAGE_81_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_COMMON_PAGE_81_INFO_COLOR
#define ANT_COMMON_PAGE_81_INFO_COLOR 0
#endif

#endif //ANT_COMMON_PAGE_81_LOG_ENABLED
// </e>

#endif //ANT_COMMON_PAGE_81_ENABLED
// </e>

// <q> ANT_ENCRYPT_CONFIG_ENABLED  - ant_encrypt_config - Cryptographic ANT stack configuration
 

#ifndef ANT_ENCRYPT_CONFIG_ENABLED
#define ANT_ENCRYPT_CONFIG_ENABLED 0
#endif

// <q> ANT_ENCRYPT_NEGOTIATION_SLAVE_ENABLED  - ant_encrypt_negotiation_slave - Encryption negotiation for encrypted ANT slave channels
 

#ifndef ANT_ENCRYPT_NEGOTIATION_SLAVE_ENABLED
#define ANT_ENCRYPT_NEGOTIATION_SLAVE_ENABLED 0
#endif

// <e> ANT_HRM_ENABLED - ant_hrm - Heart Rate Monitor Profile
//==========================================================
#ifndef ANT_HRM_ENABLED
#define ANT_HRM_ENABLED 0
#endif
#if  ANT_HRM_ENABLED
// <e> ANT_HRM_LOG_ENABLED - Enables general logging in the module.
//==========================================================
#ifndef ANT_HRM_LOG_ENABLED
#define ANT_HRM_LOG_ENABLED 0
#endif
#if  ANT_HRM_LOG_ENABLED
// <o> ANT_HRM_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_HRM_LOG_LEVEL
#define ANT_HRM_LOG_LEVEL 3
#endif

// <o> ANT_HRM_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_HRM_INFO_COLOR
#define ANT_HRM_INFO_COLOR 0
#endif

#endif //ANT_HRM_LOG_ENABLED
// </e>

// <e> ANT_HRM_PAGE_0_LOG_ENABLED - Enables logging of HRM page 0 in the module.
//==========================================================
#ifndef ANT_HRM_PAGE_0_LOG_ENABLED
#define ANT_HRM_PAGE_0_LOG_ENABLED 0
#endif
#if  ANT_HRM_PAGE_0_LOG_ENABLED
// <o> ANT_HRM_PAGE_0_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_HRM_PAGE_0_LOG_LEVEL
#define ANT_HRM_PAGE_0_LOG_LEVEL 3
#endif

// <o> ANT_HRM_PAGE_0_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_HRM_PAGE_0_INFO_COLOR
#define ANT_HRM_PAGE_0_INFO_COLOR 0
#endif

#endif //ANT_HRM_PAGE_0_LOG_ENABLED
// </e>

// <e> ANT_HRM_PAGE_1_LOG_ENABLED - Enables logging of HRM page 1 in the module.
//==========================================================
#ifndef ANT_HRM_PAGE_1_LOG_ENABLED
#define ANT_HRM_PAGE_1_LOG_ENABLED 0
#endif
#if  ANT_HRM_PAGE_1_LOG_ENABLED
// <o> ANT_HRM_PAGE_1_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_HRM_PAGE_1_LOG_LEVEL
#define ANT_HRM_PAGE_1_LOG_LEVEL 3
#endif

// <o> ANT_HRM_PAGE_1_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_HRM_PAGE_1_INFO_COLOR
#define ANT_HRM_PAGE_1_INFO_COLOR 0
#endif

#endif //ANT_HRM_PAGE_1_LOG_ENABLED
// </e>

// <e> ANT_HRM_PAGE_2_LOG_ENABLED - Enables logging of HRM page 2 in the module.
//==========================================================
#ifndef ANT_HRM_PAGE_2_LOG_ENABLED
#define ANT_HRM_PAGE_2_LOG_ENABLED 0
#endif
#if  ANT_HRM_PAGE_2_LOG_ENABLED
// <o> ANT_HRM_PAGE_2_LOG_LEVEL  - Default Severity level
 
