LiteOS/LiteOS/platform/NRF52840-PDK/config/sdk_config.h
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_HRM_PAGE_2_LOG_LEVEL
#define ANT_HRM_PAGE_2_LOG_LEVEL 3
#endif

// <o> ANT_HRM_PAGE_2_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_HRM_PAGE_2_INFO_COLOR
#define ANT_HRM_PAGE_2_INFO_COLOR 0
#endif

#endif //ANT_HRM_PAGE_2_LOG_ENABLED
// </e>

// <e> ANT_HRM_PAGE_3_LOG_ENABLED - Enables logging of HRM page 3 in the module.
//==========================================================
#ifndef ANT_HRM_PAGE_3_LOG_ENABLED
#define ANT_HRM_PAGE_3_LOG_ENABLED 0
#endif
#if  ANT_HRM_PAGE_3_LOG_ENABLED
// <o> ANT_HRM_PAGE_3_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_HRM_PAGE_3_LOG_LEVEL
#define ANT_HRM_PAGE_3_LOG_LEVEL 3
#endif

// <o> ANT_HRM_PAGE_3_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_HRM_PAGE_3_INFO_COLOR
#define ANT_HRM_PAGE_3_INFO_COLOR 0
#endif

#endif //ANT_HRM_PAGE_3_LOG_ENABLED
// </e>

// <e> ANT_HRM_PAGE_4_LOG_ENABLED - Enables logging of HRM page 4 in the module.
//==========================================================
#ifndef ANT_HRM_PAGE_4_LOG_ENABLED
#define ANT_HRM_PAGE_4_LOG_ENABLED 0
#endif
#if  ANT_HRM_PAGE_4_LOG_ENABLED
// <o> ANT_HRM_PAGE_4_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_HRM_PAGE_4_LOG_LEVEL
#define ANT_HRM_PAGE_4_LOG_LEVEL 3
#endif

// <o> ANT_HRM_PAGE_4_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_HRM_PAGE_4_INFO_COLOR
#define ANT_HRM_PAGE_4_INFO_COLOR 0
#endif

#endif //ANT_HRM_PAGE_4_LOG_ENABLED
// </e>

#endif //ANT_HRM_ENABLED
// </e>

// <q> ANT_KEY_MANAGER_ENABLED  - ant_key_manager - Software Component
 

#ifndef ANT_KEY_MANAGER_ENABLED
#define ANT_KEY_MANAGER_ENABLED 0
#endif

// <q> ANT_REQUEST_CONTROLLER_ENABLED  - ant_request_controller - ANT+ request controller
 

#ifndef ANT_REQUEST_CONTROLLER_ENABLED
#define ANT_REQUEST_CONTROLLER_ENABLED 0
#endif

// <e> ANT_SDM_ENABLED - ant_sdm - Stride Based Speed and Distance Monitor Profile
//==========================================================
#ifndef ANT_SDM_ENABLED
#define ANT_SDM_ENABLED 0
#endif
#if  ANT_SDM_ENABLED
// <e> ANT_SDM_LOG_ENABLED - Enables general logging in the module.
//==========================================================
#ifndef ANT_SDM_LOG_ENABLED
#define ANT_SDM_LOG_ENABLED 0
#endif
#if  ANT_SDM_LOG_ENABLED
// <o> ANT_SDM_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_SDM_LOG_LEVEL
#define ANT_SDM_LOG_LEVEL 3
#endif

// <o> ANT_SDM_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_SDM_INFO_COLOR
#define ANT_SDM_INFO_COLOR 0
#endif

#endif //ANT_SDM_LOG_ENABLED
// </e>

// <e> ANT_SDM_PAGE_1_LOG_ENABLED - Enables logging of SDM page 1 in the module.
//==========================================================
#ifndef ANT_SDM_PAGE_1_LOG_ENABLED
#define ANT_SDM_PAGE_1_LOG_ENABLED 0
#endif
#if  ANT_SDM_PAGE_1_LOG_ENABLED
// <o> ANT_SDM_PAGE_1_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_SDM_PAGE_1_LOG_LEVEL
#define ANT_SDM_PAGE_1_LOG_LEVEL 3
#endif

// <o> ANT_SDM_PAGE_1_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_SDM_PAGE_1_INFO_COLOR
#define ANT_SDM_PAGE_1_INFO_COLOR 0
#endif

#endif //ANT_SDM_PAGE_1_LOG_ENABLED
// </e>

// <e> ANT_SDM_PAGE_2_LOG_ENABLED - Enables logging of SDM page 2 in the module.
//==========================================================
#ifndef ANT_SDM_PAGE_2_LOG_ENABLED
#define ANT_SDM_PAGE_2_LOG_ENABLED 0
#endif
#if  ANT_SDM_PAGE_2_LOG_ENABLED
// <o> ANT_SDM_PAGE_2_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_SDM_PAGE_2_LOG_LEVEL
#define ANT_SDM_PAGE_2_LOG_LEVEL 3
#endif

// <o> ANT_SDM_PAGE_2_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_SDM_PAGE_2_INFO_COLOR
#define ANT_SDM_PAGE_2_INFO_COLOR 0
#endif

#endif //ANT_SDM_PAGE_2_LOG_ENABLED
// </e>

// <e> ANT_SDM_PAGE_3_LOG_ENABLED - Enables logging of SDM page 3 in the module.
//==========================================================
#ifndef ANT_SDM_PAGE_3_LOG_ENABLED
#define ANT_SDM_PAGE_3_LOG_ENABLED 0
#endif
#if  ANT_SDM_PAGE_3_LOG_ENABLED
// <o> ANT_SDM_PAGE_3_LOG_LEVEL  - Default Severity level
 
// <0=> Off 
// <1=> Error 
// <2=> Warning 
// <3=> Info 
// <4=> Debug 

#ifndef ANT_SDM_PAGE_3_LOG_LEVEL
#define ANT_SDM_PAGE_3_LOG_LEVEL 3
#endif

// <o> ANT_SDM_PAGE_3_INFO_COLOR  - ANSI escape code prefix.
 
// <0=> Default 
// <1=> Black 
// <2=> Red 
// <3=> Green 
// <4=> Yellow 
// <5=> Blue 
// <6=> Magenta 
// <7=> Cyan 
// <8=> White 

#ifndef ANT_SDM_PAGE_3_INFO_COLOR
#define ANT_SDM_PAGE_3_INFO_COLOR 0
#endif

#endif //ANT_SDM_PAGE_3_LOG_ENABLED
// </e>

// <e> ANT_SDM_PAGE_16_LOG_ENABLED - Enables logging of SDM page 16 in the module.
//==========================================================
#ifndef ANT_SDM_PAGE_16_LOG_ENABLED
#define ANT_SDM_PAGE_16_LOG_ENABLED 0
#endif
#if  ANT_SDM_PAGE_16_LOG_ENABLED
// <o> ANT_SDM_PAGE_16_LOG_LEVEL  - Default Severity level
 
